CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
/***************************************************************************//**
 * @file
 * @brief Clock Management Unit Private API definition.
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifndef SLI_EM_CMU_H
#define SLI_EM_CMU_H

#ifdef __cplusplus
extern "C" {
#endif

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */
#if defined(_SILICON_LABS_32B_SERIES_2)

/***************************************************************************//**
 * @brief Performs pre-clock-selection operations to initialize the system clock.
 *
 * @note FOR INTERNAL USE ONLY.
 *
 * @note This function is needed for macro expansion of CMU_CLOCK_SELECT_SET when
 *       the clock is SYSCLK.
 ******************************************************************************/
void sli_em_cmu_SYSCLKInitPreClockSelect(void);

/***************************************************************************//**
 * @brief Performs post-clock-selection operations to initialize the system clock.
 *
 * @note FOR INTERNAL USE ONLY.
 *
 * @note This function is needed for macro expansion of CMU_CLOCK_SELECT_SET when
 *       the clock is SYSCLK.
 ******************************************************************************/
void sli_em_cmu_SYSCLKInitPostClockSelect(bool optimize_divider);

/***************************************************************************//**
 * @brief Sets the HFXO0 FORCEEN bit.
 *
 * @note FOR INTERNAL USE ONLY.
 *
 * @note This function is needed for macro expansion of CMU_CLOCK_SELECT_SET when
 *       the clock is SYSCLK and the selected clock source is HFXO.
 ******************************************************************************/
void sli_em_cmu_HFXOSetForceEnable(void);

/***************************************************************************//**
 * @brief This function will set the SYSCFG->CFGSYSTIC<SYSTICEXTCLKEN> bit.
 *
 * @note FOR INTERNAL USE ONLY.
 *
 * @note This function is needed for macro expansion of CMU_CLOCK_SELECT_SET when
 *       the clock is SYSTICK.
 ******************************************************************************/
void sli_em_cmu_SYSTICEXTCLKENSet(void);

/***************************************************************************//**
 * @brief This function will clear the SYSCFG->CFGSYSTIC<SYSTICEXTCLKEN> bit.
 *
 * @note FOR INTERNAL USE ONLY.
 *
 * @note This function is needed for macro expansion of CMU_CLOCK_SELECT_SET when
 *       the clock is SYSTICK.
 ******************************************************************************/
void sli_em_cmu_SYSTICEXTCLKENClear(void);

#define CMU_SYSCLK_SELECT_HFRCODPLL                                    \
  do {                                                                 \
    sli_em_cmu_SYSCLKInitPreClockSelect();                             \
    CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) \
                      | CMU_SYSCLKCTRL_CLKSEL_HFRCODPLL;               \
    sli_em_cmu_SYSCLKInitPostClockSelect(true);                        \
  } while (0)

#define CMU_SYSCLK_SELECT_HFXO                                         \
  do {                                                                 \
    sli_em_cmu_HFXOSetForceEnable();                                   \
    sli_em_cmu_SYSCLKInitPreClockSelect();                             \
    CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) \
                      | CMU_SYSCLKCTRL_CLKSEL_HFXO;                    \
    sli_em_cmu_SYSCLKInitPostClockSelect(true);                        \
    if ((HFXO0->CTRL & HFXO_CTRL_DISONDEMAND) == 0) {                  \
      HFXO0->CTRL_CLR = HFXO_CTRL_FORCEEN;                             \
    }                                                                  \
  } while (0)

#define CMU_SYSCLK_SELECT_CLKIN0                                       \
  do {                                                                 \
    sli_em_cmu_SYSCLKInitPreClockSelect();                             \
    CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) \
                      | CMU_SYSCLKCTRL_CLKSEL_CLKIN0;                  \
    sli_em_cmu_SYSCLKInitPostClockSelect(true);                        \
  } while (0)

#define CMU_SYSCLK_SELECT_FSRCO                                        \
  do {                                                                 \
    sli_em_cmu_SYSCLKInitPreClockSelect();                             \
    CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) \
                      | CMU_SYSCLKCTRL_CLKSEL_FSRCO;                   \
    sli_em_cmu_SYSCLKInitPostClockSelect(true);                        \
  } while (0)

#if defined(RFFPLL_PRESENT)

#define CMU_SYSCLK_SELECT_RFFPLLSYS                                    \
  do {                                                                 \
    sli_em_cmu_SYSCLKInitPreClockSelect();                             \
    CMU->SYSCLKCTRL = (CMU->SYSCLKCTRL & ~_CMU_SYSCLKCTRL_CLKSEL_MASK) \
                      | CMU_SYSCLKCTRL_CLKSEL_RFFPLL0SYS;              \
    sli_em_cmu_SYSCLKInitPostClockSelect(true);                        \
  } while (0)

