CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#define CMU_LETIMER0_SELECT_PLFRCO CMU_EM23GRPACLK_SELECT_PLFRCO
#if defined(LESENSE_PRESENT)
#define CMU_LESENSE_SELECT_PLFRCO CMU_EM23GRPACLK_SELECT_PLFRCO
#define CMU_LESENSECLK_SELECT_PLFRCO CMU_EM23GRPACLK_SELECT_PLFRCO
#endif /* LESENSE_PRESENT */
#endif /* LFRCO_PRECISION_MODE */

#define CMU_EM23GRPACLK_SELECT_LFXO                                                   \
  do {                                                                                \
    CMU->EM23GRPACLKCTRL = (CMU->EM23GRPACLKCTRL & ~_CMU_EM23GRPACLKCTRL_CLKSEL_MASK) \
                           | CMU_EM23GRPACLKCTRL_CLKSEL_LFXO;                         \
  } while (0)

#define CMU_LETIMER0_SELECT_LFXO CMU_EM23GRPACLK_SELECT_LFXO
#if defined(LESENSE_PRESENT)
#define CMU_LESENSE_SELECT_LFXO CMU_EM23GRPACLK_SELECT_LFXO
#define CMU_LESENSECLK_SELECT_LFXO CMU_EM23GRPACLK_SELECT_LFXO
#endif /* LESENSE_PRESENT */

#define CMU_EM23GRPACLK_SELECT_ULFRCO                                                 \
  do {                                                                                \
    CMU->EM23GRPACLKCTRL = (CMU->EM23GRPACLKCTRL & ~_CMU_EM23GRPACLKCTRL_CLKSEL_MASK) \
                           | CMU_EM23GRPACLKCTRL_CLKSEL_ULFRCO;                       \
  } while (0)

#define CMU_LETIMER0_SELECT_ULFRCO CMU_EM23GRPACLK_SELECT_ULFRCO
#if defined(LESENSE_PRESENT)
#define CMU_LESENSE_SELECT_ULFRCO CMU_EM23GRPACLK_SELECT_ULFRCO
#define CMU_LESENSECLK_SELECT_ULFRCO CMU_EM23GRPACLK_SELECT_ULFRCO
#endif /* LESENSE_PRESENT */

#define CMU_EM23GRPACLK_SELECT_DISABLED                                               \
  do {                                                                                \
    CMU->EM23GRPACLKCTRL = (CMU->EM23GRPACLKCTRL & ~_CMU_EM23GRPACLKCTRL_CLKSEL_MASK) \
                           | CMU_EM23GRPACLKCTRL_CLKSEL_DISABLED;                     \
  } while (0)

#define CMU_EM4GRPACLK_SELECT_LFRCO                                                \
  do {                                                                             \
    CMU->EM4GRPACLKCTRL = (CMU->EM4GRPACLKCTRL & ~_CMU_EM4GRPACLKCTRL_CLKSEL_MASK) \
                          | CMU_EM4GRPACLKCTRL_CLKSEL_LFRCO;                       \
  } while (0)

#define CMU_BURTC_SELECT_LFRCO CMU_EM4GRPACLK_SELECT_LFRCO

#if defined(LFRCO_PRECISION_MODE) && (LFRCO_PRECISION_MODE == 1)
#define CMU_EM4GRPACLK_SELECT_PLFRCO                                               \
  do {                                                                             \
    CMU->EM4GRPACLKCTRL = (CMU->EM4GRPACLKCTRL & ~_CMU_EM4GRPACLKCTRL_CLKSEL_MASK) \
                          | CMU_EM4GRPACLKCTRL_CLKSEL_LFRCO;                       \
  } while (0)

#define CMU_BURTC_SELECT_PLFRCO CMU_EM4GRPACLK_SELECT_PLFRCO
#endif /* LFRCO_PRECISION_MODE */

#define CMU_EM4GRPACLK_SELECT_LFXO                                                 \
  do {                                                                             \
    CMU->EM4GRPACLKCTRL = (CMU->EM4GRPACLKCTRL & ~_CMU_EM4GRPACLKCTRL_CLKSEL_MASK) \
                          | CMU_EM4GRPACLKCTRL_CLKSEL_LFXO;                        \
  } while (0)

#define CMU_BURTC_SELECT_LFXO CMU_EM4GRPACLK_SELECT_LFXO

#define CMU_EM4GRPACLK_SELECT_ULFRCO                                               \
  do {                                                                             \
    CMU->EM4GRPACLKCTRL = (CMU->EM4GRPACLKCTRL & ~_CMU_EM4GRPACLKCTRL_CLKSEL_MASK) \
                          | CMU_EM4GRPACLKCTRL_CLKSEL_ULFRCO;                      \
  } while (0)

#define CMU_BURTC_SELECT_ULFRCO CMU_EM4GRPACLK_SELECT_ULFRCO

#define CMU_EM4GRPACLK_SELECT_DISABLED                                             \
  do {                                                                             \
    CMU->EM4GRPACLKCTRL = (CMU->EM4GRPACLKCTRL & ~_CMU_EM4GRPACLKCTRL_CLKSEL_MASK) \
                          | CMU_EM4GRPACLKCTRL_CLKSEL_DISABLED;                    \
  } while (0)

#if defined(_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK)
#define CMU_EM01GRPBCLK_SELECT_HFRCODPLL                                              \
  do {                                                                                \
    CMU->EM01GRPBCLKCTRL = (CMU->EM01GRPBCLKCTRL & ~_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) \
                           | CMU_EM01GRPBCLKCTRL_CLKSEL_HFRCODPLL;                    \
  } while (0)

#define CMU_PDMREF_SELECT_HFRCODPLL CMU_EM01GRPBCLK_SELECT_HFRCODPLL

#define CMU_EM01GRPBCLK_SELECT_HFXO                                                   \
  do {                                                                                \
    CMU->EM01GRPBCLKCTRL = (CMU->EM01GRPBCLKCTRL & ~_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) \
                           | CMU_EM01GRPBCLKCTRL_CLKSEL_HFXO;                         \
  } while (0)

#define CMU_PDMREF_SELECT_HFXO CMU_EM01GRPBCLK_SELECT_HFXO

#define CMU_EM01GRPBCLK_SELECT_FSRCO                                                  \
  do {                                                                                \
    CMU->EM01GRPBCLKCTRL = (CMU->EM01GRPBCLKCTRL & ~_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) \
                           | CMU_EM01GRPBCLKCTRL_CLKSEL_FSRCO;                        \
  } while (0)

#define CMU_PDMREF_SELECT_FSRCO CMU_EM01GRPBCLK_SELECT_FSRCO

#define CMU_EM01GRPBCLK_SELECT_CLKIN0                                                 \
  do {                                                                                \
    CMU->EM01GRPBCLKCTRL = (CMU->EM01GRPBCLKCTRL & ~_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) \
                           | CMU_EM01GRPBCLKCTRL_CLKSEL_CLKIN0;                       \
  } while (0)

#define CMU_PDMREF_SELECT_CLKIN0 CMU_EM01GRPBCLK_SELECT_CLKIN0

#define CMU_EM01GRPBCLK_SELECT_HFRCODPLLRT                                            \
  do {                                                                                \
    CMU->EM01GRPBCLKCTRL = (CMU->EM01GRPBCLKCTRL & ~_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) \
                           | CMU_EM01GRPBCLKCTRL_CLKSEL_HFRCODPLLRT;                  \
  } while (0)

#define CMU_PDMREF_SELECT_HFRCODPLLRT CMU_EM01GRPBCLK_SELECT_HFRCODPLLRT

#define CMU_EM01GRPBCLK_SELECT_HFXORT                                                 \
  do {                                                                                \
    CMU->EM01GRPBCLKCTRL = (CMU->EM01GRPBCLKCTRL & ~_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) \
                           | CMU_EM01GRPBCLKCTRL_CLKSEL_HFXORT;                       \
  } while (0)

#define CMU_PDMREF_SELECT_HFXORT CMU_EM01GRPBCLK_SELECT_HFXORT

