CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#define CMU_EM01GRPBCLK_SELECT_DISABLED                                               \
  do {                                                                                \
    CMU->EM01GRPBCLKCTRL = (CMU->EM01GRPBCLKCTRL & ~_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) \
                           | CMU_EM01GRPBCLKCTRL_CLKSEL_DISABLED;                     \
  } while (0)

#endif /* defined(_CMU_EM01GRPBCLKCTRL_CLKSEL_MASK) */

#define CMU_WDOG0_SELECT_LFRCO                                               \
  do {                                                                       \
    CMU->WDOG0CLKCTRL = (CMU->WDOG0CLKCTRL & ~_CMU_WDOG0CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG0CLKCTRL_CLKSEL_LFRCO;                     \
  } while (0)

#define CMU_WDOG0CLK_SELECT_LFRCO CMU_WDOG0_SELECT_LFRCO

#if defined(LFRCO_PRECISION_MODE) && (LFRCO_PRECISION_MODE == 1)
#define CMU_WDOG0_SELECT_PLFRCO                                              \
  do {                                                                       \
    CMU->WDOG0CLKCTRL = (CMU->WDOG0CLKCTRL & ~_CMU_WDOG0CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG0CLKCTRL_CLKSEL_LFRCO;                     \
  } while (0)

#define CMU_WDOG0CLK_SELECT_PLFRCO CMU_WDOG0_SELECT_PLFRCO
#endif /* LFRCO_PRECISION_MODE */

#define CMU_WDOG0_SELECT_LFXO                                                \
  do {                                                                       \
    CMU->WDOG0CLKCTRL = (CMU->WDOG0CLKCTRL & ~_CMU_WDOG0CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG0CLKCTRL_CLKSEL_LFXO;                      \
  } while (0)

#define CMU_WDOG0CLK_SELECT_LFXO CMU_WDOG0_SELECT_LFXO

#define CMU_WDOG0_SELECT_ULFRCO                                              \
  do {                                                                       \
    CMU->WDOG0CLKCTRL = (CMU->WDOG0CLKCTRL & ~_CMU_WDOG0CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG0CLKCTRL_CLKSEL_ULFRCO;                    \
  } while (0)

#define CMU_WDOG0CLK_SELECT_ULFRCO CMU_WDOG0_SELECT_ULFRCO

#define CMU_WDOG0_SELECT_HCLKDIV1024                                         \
  do {                                                                       \
    CMU->WDOG0CLKCTRL = (CMU->WDOG0CLKCTRL & ~_CMU_WDOG0CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG0CLKCTRL_CLKSEL_HCLKDIV1024;               \
  } while (0)

#define CMU_WDOG0CLK_SELECT_HCLKDIV1024 CMU_WDOG0_SELECT_HCLKDIV1024

#define CMU_WDOG0_SELECT_DISABLED                                            \
  do {                                                                       \
    CMU->WDOG0CLKCTRL = (CMU->WDOG0CLKCTRL & ~_CMU_WDOG0CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG0CLKCTRL_CLKSEL_DISABLED;                  \
  } while (0)
#define CMU_WDOG0CLK_SELECT_DISABLED CMU_WDOG0_SELECT_DISABLED

#if defined(_CMU_WDOG1CLKCTRL_CLKSEL_MASK)
#define CMU_WDOG1_SELECT_LFRCO                                               \
  do {                                                                       \
    CMU->WDOG1CLKCTRL = (CMU->WDOG1CLKCTRL & ~_CMU_WDOG1CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG1CLKCTRL_CLKSEL_LFRCO;                     \
  } while (0)

#define CMU_WDOG1CLK_SELECT_LFRCO CMU_WDOG1_SELECT_LFRCO

#if defined(LFRCO_PRECISION_MODE) && (LFRCO_PRECISION_MODE == 1)
#define CMU_WDOG1_SELECT_PLFRCO                                              \
  do {                                                                       \
    CMU->WDOG1CLKCTRL = (CMU->WDOG1CLKCTRL & ~_CMU_WDOG1CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG1CLKCTRL_CLKSEL_LFRCO;                     \
  } while (0)

#define CMU_WDOG1CLK_SELECT_PLFRCO CMU_WDOG1_SELECT_PLFRCO
#endif /* LFRCO_PRECISION_MODE */

#define CMU_WDOG1_SELECT_LFXO                                                \
  do {                                                                       \
    CMU->WDOG1CLKCTRL = (CMU->WDOG1CLKCTRL & ~_CMU_WDOG1CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG1CLKCTRL_CLKSEL_LFXO;                      \
  } while (0)

#define CMU_WDOG1CLK_SELECT_LFXO CMU_WDOG1_SELECT_LFXO

#define CMU_WDOG1_SELECT_ULFRCO                                              \
  do {                                                                       \
    CMU->WDOG1CLKCTRL = (CMU->WDOG1CLKCTRL & ~_CMU_WDOG1CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG1CLKCTRL_CLKSEL_ULFRCO;                    \
  } while (0)

#define CMU_WDOG1CLK_SELECT_ULFRCO CMU_WDOG1_SELECT_ULFRCO

#define CMU_WDOG1_SELECT_HCLKDIV1024                                         \
  do {                                                                       \
    CMU->WDOG1CLKCTRL = (CMU->WDOG1CLKCTRL & ~_CMU_WDOG1CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG1CLKCTRL_CLKSEL_HCLKDIV1024;               \
  } while (0)

#define CMU_WDOG1CLK_SELECT_HCLKDIV1024 CMU_WDOG1_SELECT_HCLKDIV1024

#define CMU_WDOG1_SELECT_DISABLED                                            \
  do {                                                                       \
    CMU->WDOG1CLKCTRL = (CMU->WDOG1CLKCTRL & ~_CMU_WDOG1CLKCTRL_CLKSEL_MASK) \
                        | CMU_WDOG1CLKCTRL_CLKSEL_DISABLED;                  \
  } while (0)
#define CMU_WDOG1CLK_SELECT_DISABLED  CMU_WDOG1_SELECT_DISABLED
#endif /* defined(_CMU_WDOG1CLKCTRL_CLKSEL_MASK) */

#define CMU_DPLLREFCLK_SELECT_HFXO                                                 \
  do {                                                                             \
    CMU->DPLLREFCLKCTRL = (CMU->DPLLREFCLKCTRL & ~_CMU_DPLLREFCLKCTRL_CLKSEL_MASK) \
                          | CMU_DPLLREFCLKCTRL_CLKSEL_HFXO;                        \
  } while (0)

#define CMU_DPLLREFCLK_SELECT_LFXO                                                 \
  do {                                                                             \
    CMU->DPLLREFCLKCTRL = (CMU->DPLLREFCLKCTRL & ~_CMU_DPLLREFCLKCTRL_CLKSEL_MASK) \
                          | CMU_DPLLREFCLKCTRL_CLKSEL_LFXO;                        \
  } while (0)

#define CMU_DPLLREFCLK_SELECT_CLKIN0                                               \
  do {                                                                             \
    CMU->DPLLREFCLKCTRL = (CMU->DPLLREFCLKCTRL & ~_CMU_DPLLREFCLKCTRL_CLKSEL_MASK) \
                          | CMU_DPLLREFCLKCTRL_CLKSEL_CLKIN0;                      \
  } while (0)

