CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#define CMU_DPLLREFCLK_SELECT_DISABLED                                             \
  do {                                                                             \
    CMU->DPLLREFCLKCTRL = (CMU->DPLLREFCLKCTRL & ~_CMU_DPLLREFCLKCTRL_CLKSEL_MASK) \
                          | CMU_DPLLREFCLKCTRL_CLKSEL_DISABLED;                    \
  } while (0)

#if (defined(_SILICON_LABS_32B_SERIES_2_CONFIG_4)  \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_5)  \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_6)  \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_7)  \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_8)) \
  && defined(CoreDebug_DEMCR_TRCENA_Msk)
#define CMU_TRACECLK_RESTORE_TRACE_PRE()                             \
  bool restoreTrace = CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk; \
  if (restoreTrace) {                                                \
    CoreDebug->DEMCR &= ~CoreDebug_DEMCR_TRCENA_Msk;                 \
  }                                                                  \
  do {} while (0)

#define CMU_TRACECLK_RESTORE_TRACE_POST()           \
  if (restoreTrace) {                               \
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk; \
  }                                                 \
  do {} while (0)

#else
#define CMU_TRACECLK_RESTORE_TRACE_PRE() do {} while (0)
#define CMU_TRACECLK_RESTORE_TRACE_POST() do {} while (0)
#endif

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_1)
#define CMU_TRACECLK_SELECT_HCLK                                             \
  do {                                                                       \
    CMU_TRACECLK_RESTORE_TRACE_PRE();                                        \
    CMU->TRACECLKCTRL = (CMU->TRACECLKCTRL & ~_CMU_TRACECLKCTRL_CLKSEL_MASK) \
                        | CMU_TRACECLKCTRL_CLKSEL_HCLK;                      \
    CMU_TRACECLK_RESTORE_TRACE_POST();                                       \
  } while (0)

#endif /* _SILICON_LABS_32B_SERIES_2_CONFIG_1 */

#if defined(_SILICON_LABS_32B_SERIES_2_CONFIG_4)  \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_5) \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_6) \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_7) \
  || defined(_SILICON_LABS_32B_SERIES_2_CONFIG_8)
  #define CMU_TRACECLK_SELECT_SYSCLK                                         \
  do {                                                                       \
    CMU_TRACECLK_RESTORE_TRACE_PRE();                                        \
    CMU->TRACECLKCTRL = (CMU->TRACECLKCTRL & ~_CMU_TRACECLKCTRL_CLKSEL_MASK) \
                        | CMU_TRACECLKCTRL_CLKSEL_SYSCLK;                    \
    CMU_TRACECLK_RESTORE_TRACE_POST();                                       \
  } while (0)

#define CMU_TRACECLK_SELECT_HFRCODPLLRT                                      \
  do {                                                                       \
    CMU_TRACECLK_RESTORE_TRACE_PRE();                                        \
    CMU->TRACECLKCTRL = (CMU->TRACECLKCTRL & ~_CMU_TRACECLKCTRL_CLKSEL_MASK) \
                        | CMU_TRACECLKCTRL_CLKSEL_HFRCODPLLRT;               \
    CMU_TRACECLK_RESTORE_TRACE_POST();                                       \
  } while (0)

#endif

#if defined(CMU_TRACECLKCTRL_CLKSEL_HFRCOEM23)
#define CMU_TRACECLK_SELECT_HFRCOEM23                                        \
  do {                                                                       \
    CMU_TRACECLK_RESTORE_TRACE_PRE();                                        \
    CMU->TRACECLKCTRL = (CMU->TRACECLKCTRL & ~_CMU_TRACECLKCTRL_CLKSEL_MASK) \
                        | CMU_TRACECLKCTRL_CLKSEL_HFRCOEM23;                 \
    CMU_TRACECLK_RESTORE_TRACE_POST();                                       \
  } while (0)

#endif /* CMU_TRACECLKCTRL_CLKSEL_HFRCOEM23 */

#if defined(_CMU_EUART0CLKCTRL_CLKSEL_MASK)
#define CMU_EUART0_SELECT_EM01GRPACLK                                           \
  do {                                                                          \
    CMU->EUART0CLKCTRL = (CMU->EUART0CLKCTRL & ~_CMU_EUART0CLKCTRL_CLKSEL_MASK) \
                         | _CMU_EUART0CLKCTRL_CLKSEL_EM01GRPACLK;               \
  } while (0)

#define CMU_EUART0CLK_SELECT_EM01GRPACLK CMU_EUART0_SELECT_EM01GRPACLK

#define CMU_EUART0_SELECT_EM23GRPACLK                                           \
  do {                                                                          \
    CMU->EUART0CLKCTRL = (CMU->EUART0CLKCTRL & ~_CMU_EUART0CLKCTRL_CLKSEL_MASK) \
                         | _CMU_EUART0CLKCTRL_CLKSEL_EM23GRPACLK;               \
  } while (0)

#define CMU_EUART0CLK_SELECT_EM23GRPACLK CMU_EUART0_SELECT_EM23GRPACLK

#define CMU_EUART0_SELECT_DISABLED                                              \
  do {                                                                          \
    CMU->EUART0CLKCTRL = (CMU->EUART0CLKCTRL & ~_CMU_EUART0CLKCTRL_CLKSEL_MASK) \
                         | _CMU_EUART0CLKCTRL_CLKSEL_DISABLED;                  \
  } while (0)
#define CMU_EUART0CLK_SELECT_DISABLED CMU_EUART0_SELECT_DISABLED
#endif /* _CMU_EUART0CLKCTRL_CLKSEL_MASK */

#if defined(EUSART_PRESENT)
#if defined(_CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPACLK)
#define CMU_EUSART0_SELECT_EM01GRPACLK                                             \
  do {                                                                             \
    CMU->EUSART0CLKCTRL = (CMU->EUSART0CLKCTRL & ~_CMU_EUSART0CLKCTRL_CLKSEL_MASK) \
                          | _CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPACLK;                \
  } while (0)

#define CMU_EUSART0CLK_SELECT_EM01GRPACLK CMU_EUSART0_SELECT_EM01GRPACLK
#endif /* _CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPACLK */

#if defined(_CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPCCLK)
#define CMU_EUSART0_SELECT_EM01GRPCCLK                                             \
  do {                                                                             \
    CMU->EUSART0CLKCTRL = (CMU->EUSART0CLKCTRL & ~_CMU_EUSART0CLKCTRL_CLKSEL_MASK) \
                          | _CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPCCLK;                \
  } while (0)

#define CMU_EUSART0CLK_SELECT_EM01GRPCCLK CMU_EUSART0_SELECT_EM01GRPCCLK
#endif /* _CMU_EUSART0CLKCTRL_CLKSEL_EM01GRPCCLK */

#if defined(_CMU_EUSART0CLKCTRL_CLKSEL_EM23GRPACLK)
#define CMU_EUSART0_SELECT_EM23GRPACLK                                             \
  do {                                                                             \
    CMU->EUSART0CLKCTRL = (CMU->EUSART0CLKCTRL & ~_CMU_EUSART0CLKCTRL_CLKSEL_MASK) \
                          | _CMU_EUSART0CLKCTRL_CLKSEL_EM23GRPACLK;                \
  } while (0)

#define CMU_EUSART0CLK_SELECT_EM23GRPACLK CMU_EUSART0_SELECT_EM23GRPACLK
#endif /* _CMU_EUSART0CLKCTRL_CLKSEL_EM23GRPACLK */

