CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#if defined (RTCC_PRESENT)
#define CMU_RTCC_SELECT_LFRCO                                             \
  do {                                                                    \
    CMU->RTCCCLKCTRL = (CMU->RTCCCLKCTRL & ~_CMU_RTCCCLKCTRL_CLKSEL_MASK) \
                       | CMU_RTCCCLKCTRL_CLKSEL_LFRCO;                    \
  } while (0)

#define CMU_RTCCCLK_SELECT_LFRCO CMU_RTCC_SELECT_LFRCO

#if defined(LFRCO_PRECISION_MODE) && (LFRCO_PRECISION_MODE == 1)
#define CMU_RTCC_SELECT_PLFRCO                                            \
  do {                                                                    \
    CMU->RTCCCLKCTRL = (CMU->RTCCCLKCTRL & ~_CMU_RTCCCLKCTRL_CLKSEL_MASK) \
                       | CMU_RTCCCLKCTRL_CLKSEL_LFRCO;                    \
  } while (0)

#define CMU_RTCCCLK_SELECT_PLFRCO CMU_RTCC_SELECT_PLFRCO
#endif /* LFRCO_PRECISION_MODE */

#define CMU_RTCC_SELECT_LFXO                                              \
  do {                                                                    \
    CMU->RTCCCLKCTRL = (CMU->RTCCCLKCTRL & ~_CMU_RTCCCLKCTRL_CLKSEL_MASK) \
                       | CMU_RTCCCLKCTRL_CLKSEL_LFXO;                     \
  } while (0)

#define CMU_RTCCCLK_SELECT_LFXO CMU_RTCC_SELECT_LFXO

#define CMU_RTCC_SELECT_ULFRCO                                            \
  do {                                                                    \
    CMU->RTCCCLKCTRL = (CMU->RTCCCLKCTRL & ~_CMU_RTCCCLKCTRL_CLKSEL_MASK) \
                       | CMU_RTCCCLKCTRL_CLKSEL_ULFRCO;                   \
  } while (0)

#define CMU_RTCCCLK_SELECT_ULFRCO CMU_RTCC_SELECT_ULFRCO

#endif /* RTCC_PRESENT */

#if defined(SYSRTC_PRESENT)
#define CMU_SYSRTC_SELECT_LFRCO                                                    \
  do {                                                                             \
    CMU->SYSRTC0CLKCTRL = (CMU->SYSRTC0CLKCTRL & ~_CMU_SYSRTC0CLKCTRL_CLKSEL_MASK) \
                          | CMU_SYSRTC0CLKCTRL_CLKSEL_LFRCO;                       \
  } while (0)

#define CMU_SYSRTCCLK_SELECT_LFRCO CMU_SYSRTC_SELECT_LFRCO

#if defined(LFRCO_PRECISION_MODE) && (LFRCO_PRECISION_MODE == 1)
#define CMU_SYSRTC_SELECT_PLFRCO                                                   \
  do {                                                                             \
    CMU->SYSRTC0CLKCTRL = (CMU->SYSRTC0CLKCTRL & ~_CMU_SYSRTC0CLKCTRL_CLKSEL_MASK) \
                          | CMU_SYSRTC0CLKCTRL_CLKSEL_LFRCO;                       \
  } while (0)

#define CMU_SYSRTCCLK_SELECT_PLFRCO CMU_SYSRTC_SELECT_PLFRCO
#endif /* LFRCO_PRECISION_MODE */

#define CMU_SYSRTC_SELECT_LFXO                                                     \
  do {                                                                             \
    CMU->SYSRTC0CLKCTRL = (CMU->SYSRTC0CLKCTRL & ~_CMU_SYSRTC0CLKCTRL_CLKSEL_MASK) \
                          | CMU_SYSRTC0CLKCTRL_CLKSEL_LFXO;                        \
  } while (0)

#define CMU_SYSRTCCLK_SELECT_LFXO CMU_SYSRTC_SELECT_LFXO

#define CMU_SYSRTC_SELECT_ULFRCO                                                   \
  do {                                                                             \
    CMU->SYSRTC0CLKCTRL = (CMU->SYSRTC0CLKCTRL & ~_CMU_SYSRTC0CLKCTRL_CLKSEL_MASK) \
                          | CMU_SYSRTC0CLKCTRL_CLKSEL_ULFRCO;                      \
  } while (0)

#define CMU_SYSRTCCLK_SELECT_ULFRCO CMU_SYSRTC_SELECT_ULFRCO

#define CMU_SYSRTC_SELECT_DISABLED                                                 \
  do {                                                                             \
    CMU->SYSRTC0CLKCTRL = (CMU->SYSRTC0CLKCTRL & ~_CMU_SYSRTC0CLKCTRL_CLKSEL_MASK) \
                          | CMU_SYSRTC0CLKCTRL_CLKSEL_DISABLED;                    \
  } while (0)

#define CMU_SYSRTCCLK_SELECT_DISABLED CMU_SYSRTC_SELECT_DISABLED
#endif /* SYSRTC_PRESENT */

#if defined(LCD_PRESENT)
#define CMU_LCD_SELECT_LFRCO                                             \
  do {                                                                   \
    CMU->LCDCLKCTRL =  (CMU->LCDCLKCTRL  & ~_CMU_LCDCLKCTRL_CLKSEL_MASK) \
                      | CMU_LCDCLKCTRL_CLKSEL_LFRCO;                     \
  } while (0)

#define CMU_LCDCLK_SELECT_LFRCO CMU_LCD_SELECT_LFRCO

#if defined(LFRCO_PRECISION_MODE) && (LFRCO_PRECISION_MODE == 1)
#define CMU_LCD_SELECT_PLFRCO                                            \
  do {                                                                   \
    CMU->LCDCLKCTRL =  (CMU->LCDCLKCTRL  & ~_CMU_LCDCLKCTRL_CLKSEL_MASK) \
                      | CMU_LCDCLKCTRL_CLKSEL_LFRCO;                     \
  } while (0)

#define CMU_LCDCLK_SELECT_PLFRCO CMU_LCD_SELECT_PLFRCO
#endif /* LFRCO_PRECISION_MODE */

#define CMU_LCD_SELECT_LFXO                                              \
  do {                                                                   \
    CMU->LCDCLKCTRL =  (CMU->LCDCLKCTRL  & ~_CMU_LCDCLKCTRL_CLKSEL_MASK) \
                      | CMU_LCDCLKCTRL_CLKSEL_LFXO;                      \
  } while (0)

#define CMU_LCDCLK_SELECT_LFXO CMU_LCD_SELECT_LFXO

#define CMU_LCD_SELECT_ULFRCO                                            \
  do {                                                                   \
    CMU->LCDCLKCTRL =  (CMU->LCDCLKCTRL  & ~_CMU_LCDCLKCTRL_CLKSEL_MASK) \
                      | CMU_LCDCLKCTRL_CLKSEL_ULFRCO;                    \
  } while (0)

#define CMU_LCDCLK_SELECT_ULFRCO CMU_LCD_SELECT_ULFRCO
#endif /* LCD_PRESENT */

#if defined(VDAC_PRESENT)
#define CMU_VDAC0_SELECT_FSRCO                                               \
  do {                                                                       \
    CMU->VDAC0CLKCTRL = (CMU->VDAC0CLKCTRL & ~_CMU_VDAC0CLKCTRL_CLKSEL_MASK) \
                        | CMU_VDAC0CLKCTRL_CLKSEL_FSRCO;                     \
  } while (0)

#define CMU_VDAC0CLK_SELECT_FSRCO CMU_VDAC_SELECT_FSRCO

#define CMU_VDAC0_SELECT_HFRCOEM23                                           \
  do {                                                                       \
    CMU->VDAC0CLKCTRL = (CMU->VDAC0CLKCTRL & ~_CMU_VDAC0CLKCTRL_CLKSEL_MASK) \
                        | CMU_VDAC0CLKCTRL_CLKSEL_HFRCOEM23;                 \
  } while (0)

#define CMU_VDAC0CLK_SELECT_HFRCOEM23 CMU_VDAC_SELECT_HFRCOEM23

#define CMU_VDAC0_SELECT_EM01GRPACLK                                         \
  do {                                                                       \
    CMU->VDAC0CLKCTRL = (CMU->VDAC0CLKCTRL & ~_CMU_VDAC0CLKCTRL_CLKSEL_MASK) \
                        | CMU_VDAC0CLKCTRL_CLKSEL_EM01GRPACLK;               \
  } while (0)

#define CMU_VDAC0CLK_SELECT_EM01GRPACLK CMU_VDAC_SELECT_EM01GRPACLK

#define CMU_VDAC0_SELECT_EM23GRPACLK                                         \
  do {                                                                       \
    CMU->VDAC0CLKCTRL = (CMU->VDAC0CLKCTRL & ~_CMU_VDAC0CLKCTRL_CLKSEL_MASK) \
                        | CMU_VDAC0CLKCTRL_CLKSEL_EM23GRPACLK;               \
  } while (0)

#define CMU_VDAC0CLK_SELECT_EM23GRPACLK CMU_VDAC_SELECT_EM23GRPACLK

