CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#if defined(CMU_HFCLKSTATUS_SELECTED_CLKIN0)
/***************************************************************************//**
 * @brief This function is used to initialize the HF clock and selecting
 *        CLKIN0 as the clock source.
 *
 * @note FOR INTERNAL USE ONLY.
 *
 * @note This function is needed for macro expansion of CMU_CLOCK_SELECT_SET when
 *       the clock is HF and CLKIN0 is selected as the clock source.
 ******************************************************************************/
void sli_em_cmu_HFClockSelectCLKIN0(void);
#endif

#if defined(CMU_HFCLKSTATUS_SELECTED_USHFRCO)
/***************************************************************************//**
 * @brief This function is used to initialize the HF clock and selecting
 *        USHFRCO as the clock source.
 *
 * @note FOR INTERNAL USE ONLY.
 *
 * @note This function is needed for macro expansion of CMU_CLOCK_SELECT_SET when
 *       the clock is HF and USHFRCO is selected as the clock source.
 ******************************************************************************/
void sli_em_cmu_HFClockSelectUSHFRCO(void);
#endif

#define CMU_HF_SELECT_LFXO                               \
  do {                                                   \
    sli_em_cmu_HFClockSelectLFOsc((uint8_t)cmuOsc_LFXO); \
  } while (0)

#define CMU_HF_SELECT_LFRCO                               \
  do {                                                    \
    sli_em_cmu_HFClockSelectLFOsc((uint8_t)cmuOsc_LFRCO); \
  } while (0)

#define CMU_HF_SELECT_HFXO          \
  do {                              \
    sli_em_cmu_HFClockSelectHFXO(); \
  } while (0)

#define CMU_HF_SELECT_HFRCO          \
  do {                               \
    sli_em_cmu_HFClockSelectHFRCO(); \
  } while (0)

#if defined(CMU_CMD_HFCLKSEL_USHFRCODIV2)
#define CMU_HF_SELECT_USHFRCODIV2          \
  do {                                     \
    sli_em_cmu_HFClockSelectUSHFRCODIV2(); \
  } while (0)
#endif

#if defined(CMU_HFCLKSTATUS_SELECTED_HFRCODIV2)
#define CMU_HF_SELECT_HFRCODIV2          \
  do {                                   \
    sli_em_cmu_HFClockSelectHFRCODIV2(); \
  } while (0)
#endif

#if defined(CMU_HFCLKSTATUS_SELECTED_CLKIN0)
#define CMU_HF_SELECT_CLKIN0          \
  do {                                \
    sli_em_cmu_HFClockSelectCLKIN0(); \
  } while (0)
#endif

#if defined(CMU_HFCLKSTATUS_SELECTED_USHFRCO)
#define CMU_HF_SELECT_USHFRCO          \
  do {                                 \
    sli_em_cmu_HFClockSelectUSHFRCO(); \
  } while (0)
#endif

#if defined(_SILICON_LABS_32B_SERIES_1)
#define CMU_LFA_SELECT_DISABLED                   \
  do {                                            \
    CMU->LFACLKSEL = _CMU_LFACLKSEL_LFA_DISABLED; \
  } while (0)

#define CMU_LFA_SELECT_LFXO                        \
  do {                                             \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true); \
    CMU->LFACLKSEL = _CMU_LFACLKSEL_LFA_LFXO;      \
  } while (0)

#define CMU_LFA_SELECT_LFRCO                        \
  do {                                              \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true); \
    CMU->LFACLKSEL = _CMU_LFACLKSEL_LFA_LFRCO;      \
  } while (0)

#define CMU_LFA_SELECT_ULFRCO                   \
  do {                                          \
    CMU->LFACLKSEL = _CMU_LFACLKSEL_LFA_ULFRCO; \
  } while (0)

#if defined(CMU_OSCENCMD_PLFRCOEN)
#define CMU_LFA_SELECT_PLFRCO                        \
  do {                                               \
    CMU_OscillatorEnable(cmuOsc_PLFRCO, true, true); \
    CMU->LFACLKSEL = _CMU_LFACLKSEL_LFA_PLFRCO;      \
  } while (0)
#endif /* CMU_OSCENCMD_PLFRCOEN */

#define CMU_LFB_SELECT_DISABLED                   \
  do {                                            \
    CMU->LFBCLKSEL = _CMU_LFBCLKSEL_LFB_DISABLED; \
  } while (0)

#define CMU_LFB_SELECT_LFXO                        \
  do {                                             \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true); \
    CMU->LFBCLKSEL = _CMU_LFBCLKSEL_LFB_LFXO;      \
  } while (0)

#define CMU_LFB_SELECT_LFRCO                        \
  do {                                              \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true); \
    CMU->LFBCLKSEL = _CMU_LFBCLKSEL_LFB_LFRCO;      \
  } while (0)

#define CMU_LFB_SELECT_HFCLKLE                                        \
  do {                                                                \
    sli_em_cmu_SetHFLEConfigHFClock();                                \
    BUS_RegBitWrite(&CMU->HFBUSCLKEN0, _CMU_HFBUSCLKEN0_LE_SHIFT, 1); \
    CMU->LFBCLKSEL = _CMU_LFBCLKSEL_LFB_HFCLKLE;                      \
  } while (0)

#define CMU_LFB_SELECT_ULFRCO                   \
  do {                                          \
    CMU->LFBCLKSEL = _CMU_LFBCLKSEL_LFB_ULFRCO; \
  } while (0)

#if defined(CMU_OSCENCMD_PLFRCOEN)
#define CMU_LFB_SELECT_PLFRCO                        \
  do {                                               \
    CMU_OscillatorEnable(cmuOsc_PLFRCO, true, true); \
    CMU->LFBCLKSEL = _CMU_LFBCLKSEL_LFB_PLFRCO;      \
  } while (0)
#endif /* CMU_OSCENCMD_PLFRCOEN */

#if defined(_CMU_LFCCLKSEL_MASK)
#define CMU_LFC_SELECT_DISABLED                   \
  do {                                            \
    CMU->LFCCLKSEL = _CMU_LFCCLKSEL_LFC_DISABLED; \
  } while (0)

#define CMU_LFC_SELECT_LFXO                        \
  do {                                             \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true); \
    CMU->LFCCLKSEL = _CMU_LFCCLKSEL_LFC_LFXO;      \
  } while (0)

#define CMU_LFC_SELECT_LFRCO                        \
  do {                                              \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true); \
    CMU->LFCCLKSEL = _CMU_LFCCLKSEL_LFC_LFRCO;      \
  } while (0)

#define CMU_LFC_SELECT_ULFRCO                   \
  do {                                          \
    CMU->LFCCLKSEL = _CMU_LFCCLKSEL_LFC_ULFRCO; \
  } while (0)

#endif /* _CMU_LFCCLKSEL_MASK */

#define CMU_LFE_SELECT_DISABLED                   \
  do {                                            \
    CMU->LFECLKSEL = _CMU_LFECLKSEL_LFE_DISABLED; \
  } while (0)

