CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#define CMU_LFB_SELECT_LFXO                                                 \
  do {                                                                      \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true);                          \
    CMU->LFCLKSEL = (CMU->LFCLKSEL                                          \
                     & ~(_CMU_LFCLKSEL_LFB_MASK | _CMU_LFCLKSEL_LFBE_MASK)) \
                    | (_CMU_LFCLKSEL_LFB_LFXO << _CMU_LFCLKSEL_LFB_SHIFT)   \
                    | (0 << _CMU_LFCLKSEL_LFBE_SHIFT);                      \
  } while (0)

#define CMU_LFB_SELECT_LFRCO                                                \
  do {                                                                      \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL                                          \
                     & ~(_CMU_LFCLKSEL_LFB_MASK | _CMU_LFCLKSEL_LFBE_MASK)) \
                    | (_CMU_LFCLKSEL_LFB_LFRCO << _CMU_LFCLKSEL_LFB_SHIFT)  \
                    | (0 << _CMU_LFCLKSEL_LFBE_SHIFT);                      \
  } while (0)

#define CMU_LFB_SELECT_HFCLKLE                                                       \
  do {                                                                               \
    sli_em_cmu_SetHFLEConfigSystemCoreClock();                                       \
    BUS_RegBitWrite(&CMU->HFCORECLKEN0, _CMU_HFCORECLKEN0_LE_SHIFT, 1);              \
    CMU->LFCLKSEL = (CMU->LFCLKSEL                                                   \
                     & ~(_CMU_LFCLKSEL_LFB_MASK | _CMU_LFCLKSEL_LFBE_MASK))          \
                    | (_CMU_LFCLKSEL_LFB_HFCORECLKLEDIV2 << _CMU_LFCLKSEL_LFB_SHIFT) \
                    | (0 << _CMU_LFCLKSEL_LFBE_SHIFT);                               \
  } while (0)

#if defined(CMU_LFCLKSEL_LFBE_ULFRCO)
#define CMU_LFB_SELECT_ULFRCO                                                 \
  do {                                                                        \
    CMU->LFCLKSEL = (CMU->LFCLKSEL                                            \
                     & ~(_CMU_LFCLKSEL_LFB_MASK | _CMU_LFCLKSEL_LFBE_MASK))   \
                    | (_CMU_LFCLKSEL_LFB_DISABLED << _CMU_LFCLKSEL_LFB_SHIFT) \
                    | (1 << _CMU_LFCLKSEL_LFBE_SHIFT);                        \
  } while (0)
#endif

#else
#define CMU_LFB_SELECT_DISABLED                                                \
  do {                                                                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFB_MASK)                  \
                    | (_CMU_LFCLKSEL_LFB_DISABLED << _CMU_LFCLKSEL_LFB_SHIFT); \
  } while (0)

#define CMU_LFB_SELECT_LFXO                                                \
  do {                                                                     \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true);                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFB_MASK)              \
                    | (_CMU_LFCLKSEL_LFB_LFXO << _CMU_LFCLKSEL_LFB_SHIFT); \
  } while (0)

#define CMU_LFB_SELECT_LFRCO                                                \
  do {                                                                      \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFB_MASK)               \
                    | (_CMU_LFCLKSEL_LFB_LFRCO << _CMU_LFCLKSEL_LFB_SHIFT); \
  } while (0)

#define CMU_LFB_SELECT_HFCLKLE                                                        \
  do {                                                                                \
    sli_em_cmu_SetHFLEConfigSystemCoreClock();                                        \
    BUS_RegBitWrite(&CMU->HFCORECLKEN0, _CMU_HFCORECLKEN0_LE_SHIFT, 1);               \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFB_MASK)                         \
                    | (_CMU_LFCLKSEL_LFB_HFCORECLKLEDIV2 << _CMU_LFCLKSEL_LFB_SHIFT); \
  } while (0)

#if defined(CMU_LFCLKSEL_LFBE_ULFRCO)
#define CMU_LFB_SELECT_ULFRCO                                                  \
  do {                                                                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFB_MASK)                  \
                    | (_CMU_LFCLKSEL_LFB_DISABLED << _CMU_LFCLKSEL_LFB_SHIFT); \
  } while (0)
#endif /* CMU_LFCLKSEL_LFBE_ULFRCO */
#endif /* _CMU_LFCLKSEL_LFBE_MASK */

#define CMU_LFC_SELECT_DISABLED                                                \
  do {                                                                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFC_MASK)                  \
                    | (_CMU_LFCLKSEL_LFC_DISABLED << _CMU_LFCLKSEL_LFC_SHIFT); \
  } while (0)

#define CMU_LFC_SELECT_LFXO                                                \
  do {                                                                     \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true);                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFC_MASK)              \
                    | (_CMU_LFCLKSEL_LFC_LFXO << _CMU_LFCLKSEL_LFC_SHIFT); \
  } while (0)

#define CMU_LFC_SELECT_LFRCO                                                \
  do {                                                                      \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);                         \
    CMU->LFCLKSEL = (CMU->LFCLKSEL & ~_CMU_LFCLKSEL_LFC_MASK)               \
                    | (_CMU_LFCLKSEL_LFC_LFRCO << _CMU_LFCLKSEL_LFC_SHIFT); \
  } while (0)
#endif /* _SILICON_LABS_32B_SERIES_0 */

#if defined(_CMU_DBGCLKSEL_DBG_MASK)
#define CMU_DBG_SELECT_AUXHFRCO                  \
  do {                                           \
    CMU->DBGCLKSEL = CMU_DBGCLKSEL_DBG_AUXHFRCO; \
  } while (0)

#define CMU_DBG_SELECT_HFCLK                  \
  do {                                        \
    CMU->DBGCLKSEL = CMU_DBGCLKSEL_DBG_HFCLK; \
  } while (0)
#endif /* _CMU_DBGCLKSEL_DBG_MASK */

#if defined(CMU_CTRL_DBGCLK)
#define CMU_DBG_SELECT_AUXHFRCO                        \
  do {                                                 \
    CMU->CTRL = (CMU->CTRL & ~(_CMU_CTRL_DBGCLK_MASK)) \
                | CMU_CTRL_DBGCLK_AUXHFRCO;            \
  } while (0)

