CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#define CMU_DBG_SELECT_HFCLK                           \
  do {                                                 \
    CMU->CTRL = (CMU->CTRL & ~(_CMU_CTRL_DBGCLK_MASK)) \
                | CMU_CTRL_DBGCLK_HFCLK;               \
  } while (0)
#endif /* CMU_CTRL_DBGCLK */

#if defined(USB_PRESENT) && defined(_CMU_HFCORECLKEN0_USBC_MASK)
#define CMU_USBC_SELECT_LFXO                               \
  do {                                                     \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true);         \
    CMU->CMD = CMU_CMD_USBCCLKSEL_LFXO;                    \
    while ((CMU->STATUS & CMU_STATUS_USBCLFXOSEL) == 0) {} \
  } while (0)

#define CMU_USBC_SELECT_LFRCO                               \
  do {                                                      \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);         \
    CMU->CMD = CMU_CMD_USBCCLKSEL_LFRCO;                    \
    while ((CMU->STATUS & CMU_STATUS_USBCLFRCOSEL) == 0) {} \
  } while (0)

#if defined(CMU_STATUS_USBCHFCLKSEL)
#define CMU_USBC_SELECT_HFCLK                               \
  do {                                                      \
    CMU->CMD = CMU_CMD_USBCCLKSEL_HFCLKNODIV;               \
    while ((CMU->STATUS & CMU_STATUS_USBCHFCLKSEL) == 0) {} \
  } while (0)
#endif /* CMU_STATUS_USBCHFCLKSEL */

#if defined(CMU_CMD_USBCCLKSEL_USHFRCO)
#define CMU_USBC_SELECT_USHFRCO                               \
  do {                                                        \
    CMU_OscillatorEnable(cmuOsc_USHFRCO, true, true);         \
    CMU->CMD = CMU_CMD_USBCCLKSEL_USHFRCO;                    \
    while ((CMU->STATUS & CMU_STATUS_USBCUSHFRCOSEL) == 0) {} \
  } while (0)
#endif /* CMU_CMD_USBCCLKSEL_USHFRCO */
#endif /* USB_PRESENT && _CMU_HFCORECLKEN0_USBC_MASK */

#if defined(_CMU_ADCCTRL_ADC0CLKSEL_MASK)
#define CMU_ADC0ASYNC_SELECT_DISABLED                                                     \
  do {                                                                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC0CLKSEL_MASK)                         \
                   | (_CMU_ADCCTRL_ADC0CLKSEL_DISABLED << _CMU_ADCCTRL_ADC0CLKSEL_SHIFT); \
  } while (0)

#define CMU_ADC0ASYNC_SELECT_AUXHFRCO                                                     \
  do {                                                                                    \
    CMU_OscillatorEnable(cmuOsc_AUXHFRCO, true, true);                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC0CLKSEL_MASK)                         \
                   | (_CMU_ADCCTRL_ADC0CLKSEL_AUXHFRCO << _CMU_ADCCTRL_ADC0CLKSEL_SHIFT); \
  } while (0)

#define CMU_ADC0ASYNC_SELECT_HFXO                                                     \
  do {                                                                                \
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC0CLKSEL_MASK)                     \
                   | (_CMU_ADCCTRL_ADC0CLKSEL_HFXO << _CMU_ADCCTRL_ADC0CLKSEL_SHIFT); \
  } while (0)

#define CMU_ADC0ASYNC_SELECT_HFSRCCLK                                                     \
  do {                                                                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC0CLKSEL_MASK)                         \
                   | (_CMU_ADCCTRL_ADC0CLKSEL_HFSRCCLK << _CMU_ADCCTRL_ADC0CLKSEL_SHIFT); \
  } while (0)
#endif /* _CMU_ADCCTRL_ADC0CLKSEL_MASK */

#if defined(_CMU_ADCCTRL_ADC1CLKSEL_MASK)
#define CMU_ADC1ASYNC_SELECT_DISABLED                                                     \
  do {                                                                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC1CLKSEL_MASK)                         \
                   | (_CMU_ADCCTRL_ADC1CLKSEL_DISABLED << _CMU_ADCCTRL_ADC1CLKSEL_SHIFT); \
  } while (0)

#define CMU_ADC1ASYNC_SELECT_AUXHFRCO                                                     \
  do {                                                                                    \
    CMU_OscillatorEnable(cmuOsc_AUXHFRCO, true, true);                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC1CLKSEL_MASK)                         \
                   | (_CMU_ADCCTRL_ADC1CLKSEL_AUXHFRCO << _CMU_ADCCTRL_ADC1CLKSEL_SHIFT); \
  } while (0)

#define CMU_ADC1ASYNC_SELECT_HFXO                                                     \
  do {                                                                                \
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC1CLKSEL_MASK)                     \
                   | (_CMU_ADCCTRL_ADC1CLKSEL_HFXO << _CMU_ADCCTRL_ADC1CLKSEL_SHIFT); \
  } while (0)

#define CMU_ADC1ASYNC_SELECT_HFSRCCLK                                                     \
  do {                                                                                    \
    CMU->ADCCTRL = (CMU->ADCCTRL & ~_CMU_ADCCTRL_ADC1CLKSEL_MASK)                         \
                   | (_CMU_ADCCTRL_ADC1CLKSEL_HFSRCCLK << _CMU_ADCCTRL_ADC1CLKSEL_SHIFT); \
  } while (0)
#endif /* _CMU_ADCCTRL_ADC1CLKSEL_MASK */

#if defined(_CMU_SDIOCTRL_SDIOCLKSEL_MASK)
#define CMU_SDIOREF_SELECT_HFRCO                                                          \
  do {                                                                                    \
    CMU_OscillatorEnable(cmuOsc_HFRCO, true, true);                                       \
    CMU->SDIOCTRL = (CMU->SDIOCTRL & ~_CMU_SDIOCTRL_SDIOCLKSEL_MASK)                      \
                    | (_CMU_SDIOCTRL_SDIOCLKSEL_HFRCO << _CMU_SDIOCTRL_SDIOCLKSEL_SHIFT); \
  } while (0)

#define CMU_SDIOREF_SELECT_HFXO                                                          \
  do {                                                                                   \
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);                                       \
    CMU->SDIOCTRL = (CMU->SDIOCTRL & ~_CMU_SDIOCTRL_SDIOCLKSEL_MASK)                     \
                    | (_CMU_SDIOCTRL_SDIOCLKSEL_HFXO << _CMU_SDIOCTRL_SDIOCLKSEL_SHIFT); \
  } while (0)

#define CMU_SDIOREF_SELECT_AUXHFRCO                                                          \
  do {                                                                                       \
    CMU_OscillatorEnable(cmuOsc_AUXHFRCO, true, true);                                       \
    CMU->SDIOCTRL = (CMU->SDIOCTRL & ~_CMU_SDIOCTRL_SDIOCLKSEL_MASK)                         \
                    | (_CMU_SDIOCTRL_SDIOCLKSEL_AUXHFRCO << _CMU_SDIOCTRL_SDIOCLKSEL_SHIFT); \
  } while (0)

#define CMU_SDIOREF_SELECT_USHFRCO                                                          \
  do {                                                                                      \
    CMU_OscillatorEnable(cmuOsc_USHFRCO, true, true);                                       \
    CMU->SDIOCTRL = (CMU->SDIOCTRL & ~_CMU_SDIOCTRL_SDIOCLKSEL_MASK)                        \
                    | (_CMU_SDIOCTRL_SDIOCLKSEL_USHFRCO << _CMU_SDIOCTRL_SDIOCLKSEL_SHIFT); \
  } while (0)
#endif /* _CMU_SDIOCTRL_SDIOCLKSEL_MASK */

#if defined(_CMU_QSPICTRL_QSPI0CLKSEL_MASK)
#define CMU_QSPI0REF_SELECT_HFRCO                                                           \
  do {                                                                                      \
    CMU_OscillatorEnable(cmuOsc_HFRCO, true, true);                                         \
    CMU->QSPICTRL = (CMU->QSPICTRL & ~_CMU_QSPICTRL_QSPI0CLKSEL_MASK)                       \
                    | (_CMU_QSPICTRL_QSPI0CLKSEL_HFRCO << _CMU_QSPICTRL_QSPI0CLKSEL_SHIFT); \
  } while (0)

