CiscoDevNet/csmp-agent-lib/efr32_wisun/gecko_sdk_2024.6.0/platform/emlib/inc/sli_em_cmu.h
#define CMU_QSPI0REF_SELECT_HFXO                                                           \
  do {                                                                                     \
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);                                         \
    CMU->QSPICTRL = (CMU->QSPICTRL & ~_CMU_QSPICTRL_QSPI0CLKSEL_MASK)                      \
                    | (_CMU_QSPICTRL_QSPI0CLKSEL_HFXO << _CMU_QSPICTRL_QSPI0CLKSEL_SHIFT); \
  } while (0)

#define CMU_QSPI0REF_SELECT_AUXHFRCO                                                           \
  do {                                                                                         \
    CMU_OscillatorEnable(cmuOsc_AUXHFRCO, true, true);                                         \
    CMU->QSPICTRL = (CMU->QSPICTRL & ~_CMU_QSPICTRL_QSPI0CLKSEL_MASK)                          \
                    | (_CMU_QSPICTRL_QSPI0CLKSEL_AUXHFRCO << _CMU_QSPICTRL_QSPI0CLKSEL_SHIFT); \
  } while (0)

#define CMU_QSPI0REF_SELECT_USHFRCO                                                           \
  do {                                                                                        \
    CMU_OscillatorEnable(cmuOsc_USHFRCO, true, true);                                         \
    CMU->QSPICTRL = (CMU->QSPICTRL & ~_CMU_QSPICTRL_QSPI0CLKSEL_MASK)                         \
                    | (_CMU_QSPICTRL_QSPI0CLKSEL_USHFRCO << _CMU_QSPICTRL_QSPI0CLKSEL_SHIFT); \
  } while (0)
#endif /* _CMU_QSPICTRL_QSPI0CLKSEL_MASK */

#if defined(_CMU_USBCTRL_USBCLKSEL_MASK)
#define CMU_USBR_SELECT_USHFRCO                                                        \
  do {                                                                                 \
    CMU_OscillatorEnable(cmuOsc_USHFRCO, true, true);                                  \
    CMU->USBCTRL = (CMU->USBCTRL & ~_CMU_USBCTRL_USBCLKSEL_MASK)                       \
                   | (_CMU_USBCTRL_USBCLKSEL_USHFRCO << _CMU_USBCTRL_USBCLKSEL_SHIFT); \
  } while (0)

#define CMU_USBR_SELECT_HFXO                                                        \
  do {                                                                              \
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);                                  \
    CMU->USBCTRL = (CMU->USBCTRL & ~_CMU_USBCTRL_USBCLKSEL_MASK)                    \
                   | (_CMU_USBCTRL_USBCLKSEL_HFXO << _CMU_USBCTRL_USBCLKSEL_SHIFT); \
  } while (0)

#define CMU_USBR_SELECT_HFXOX2                                                        \
  do {                                                                                \
    EFM_ASSERT(SystemHFXOClockGet() <= 25000000u);                                    \
    CMU->HFXOCTRL |= CMU_HFXOCTRL_HFXOX2EN;                                           \
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);                                    \
    CMU->USBCTRL = (CMU->USBCTRL & ~_CMU_USBCTRL_USBCLKSEL_MASK)                      \
                   | (_CMU_USBCTRL_USBCLKSEL_HFXOX2 << _CMU_USBCTRL_USBCLKSEL_SHIFT); \
  } while (0)

#define CMU_USBR_SELECT_HFRCO                                                        \
  do {                                                                               \
    CMU_OscillatorEnable(cmuOsc_HFRCO, true, true);                                  \
    CMU->USBCTRL = (CMU->USBCTRL & ~_CMU_USBCTRL_USBCLKSEL_MASK)                     \
                   | (_CMU_USBCTRL_USBCLKSEL_HFRCO << _CMU_USBCTRL_USBCLKSEL_SHIFT); \
  } while (0)

#define CMU_USBR_SELECT_LFXO                                                        \
  do {                                                                              \
    CMU_OscillatorEnable(cmuOsc_LFXO, true, true);                                  \
    CMU->USBCTRL = (CMU->USBCTRL & ~_CMU_USBCTRL_USBCLKSEL_MASK)                    \
                   | (_CMU_USBCTRL_USBCLKSEL_LFXO << _CMU_USBCTRL_USBCLKSEL_SHIFT); \
  } while (0)

#define CMU_USBR_SELECT_LFRCO                                                        \
  do {                                                                               \
    CMU_OscillatorEnable(cmuOsc_LFRCO, true, true);                                  \
    CMU->USBCTRL = (CMU->USBCTRL & ~_CMU_USBCTRL_USBCLKSEL_MASK)                     \
                   | (_CMU_USBCTRL_USBCLKSEL_LFRCO << _CMU_USBCTRL_USBCLKSEL_SHIFT); \
  } while (0)
#endif /* _CMU_USBCTRL_USBCLKSEL_MASK */

#if defined(_CMU_PDMCTRL_PDMCLKSEL_MASK)
#define CMU_PDMREF_SELECT_USHFRCO                                                      \
  do {                                                                                 \
    CMU_OscillatorEnable(cmuOsc_USHFRCO, true, true);                                  \
    CMU->PDMCTRL = (CMU->PDMCTRL & ~_CMU_PDMCTRL_PDMCLKSEL_MASK)                       \
                   | (_CMU_PDMCTRL_PDMCLKSEL_USHFRCO << _CMU_PDMCTRL_PDMCLKSEL_SHIFT); \
  } while (0)

#define CMU_PDMREF_SELECT_HFXO                                                      \
  do {                                                                              \
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);                                  \
    CMU->PDMCTRL = (CMU->PDMCTRL & ~_CMU_PDMCTRL_PDMCLKSEL_MASK)                    \
                   | (_CMU_PDMCTRL_PDMCLKSEL_HFXO << _CMU_PDMCTRL_PDMCLKSEL_SHIFT); \
  } while (0)

#define CMU_PDMREF_SELECT_HFRCO                                                      \
  do {                                                                               \
    CMU_OscillatorEnable(cmuOsc_HFRCO, true, true);                                  \
    CMU->PDMCTRL = (CMU->PDMCTRL & ~_CMU_PDMCTRL_PDMCLKSEL_MASK)                     \
                   | (_CMU_PDMCTRL_PDMCLKSEL_HFRCO << _CMU_PDMCTRL_PDMCLKSEL_SHIFT); \
  } while (0)
#endif /* _CMU_PDMCTRL_PDMCLKSEL_MASK */
#endif /* _SILICON_LABS_32B_SERIES_2 */
/** @endcond */

#ifdef __cplusplus
}
#endif

#endif /* SLI_EM_CMU_H */
